#Оголошуэмо функцію і називаэмо її myPrint
def myPrint():# Дана функція не приймає параметри
    print("Це моя функція")
myPrint() # Викликаємо або оголошуємо дану функцію

# Ососбливості використанння функцій:
# 1. функції можуть приймати параметри або бути без них
#параметри -це вхідні дані для функції
#В залежності від задачі, яка ставиться для функції вона може:
#1)не приймати параметри взагалі або приймати 1 , 2 або більше (масив=набір) параметрів

#Для побудови функції з параметрами ,ми повинні вказати назву вхідного параметру:

#Давайте зробимо функцію , яка приймає 1 параметр-змінну і виводити значення параметру на екран:
def myHelloFriend(text):# назва функції myHelloFriend.Змінна text- це формальний параметр функції,
# який може використовуватися у середині функції-фактично якийсь текст
    print("---"+text+"---")
myHelloFriend("Салют команда!") #text = Салют команда!
name=input("Як Вас звати " )
myHelloFriend("Ваше ім'я "+name) #Функція приймає фактичний параметр name


