#print("Привіт команда!")
#Функція-це іменований блок коду, який виконує певне завдання
#Вони допомагають уникати проблеми дублювання коду
#Ми можемо оголосити функцю і описати її, потім викликати її довільну кількість разів у будь- якому місті
#Прототип оголошення функції
# def назва функціі():
    # блок кoду функції- не може посинатися з цифер, не може містити пробілів
    # не може містити зарезервовані слова-if, else, for,while...
    # print, input-вбудовані функції
    # Функція особлива тим, що в кінці слова має дужки
    #У кінці огоошення функції стоїть двокрапка
    #Тіло функції або блок коду функції- що буде виконувати функція
    #Має буде відступ на 4 пробіли або один Tab
    #Перед створенням функції призначаємо що вона буде робити

    #Пишемо функцію , яка буде вітати користувача з Днем Закоханих.Запис функції Camelcase-кожне нове слово з великої літери

def greetValentines():
    print("Вітаю з Днем Закоханих!")    #описуємо функцію
    print("Шукай свою половинку серця!")

#Ми створили функцію яка буде виводити 2 рядка тексту
    #Викликаємо функцію(код функції). в даному місці функія виконає свій код:
greetValentines()
#Тепер викликаємо функцію кілька разів
count=input("Скільки разів вас привітати з Днем Закоханих? -> ")
intCount=int(count)# Перетворюємо рядок у ціле число
i=0
while i< intCount:
    greetValentines()#Виклик функціїї
    i+=1 #Збільшуємо лічильник на 1 #Щоб while не виконувався безкінечну кількісь разів