#будемо робити функцію ,яка буде виводит повідомлення певну кількість разів
#функція приймає 1 параметр=кількість

def myPrintCount(countView): #countView-це кількість(число ітерації роботи циклу)
    i=0 #Число яке відповідає за кількість ітерацій циклу
    if countView< 0:
        print("Недопустиме значення кількості", countView)
        return #Вихід із функції
    while (i!=countView): # while  - працює поки умова істина
        print("Обідати") #Працює поки не дійде до countView
        i+=1 #збільшує лічильник циклу. Якщо iперший раз відпрацювало як 0, то наступний раз прац.є як 1 і так далі, поки не дойде до числа countView

myCount= input("Вкажіть кількість повторів ")
myPrintCount(int(myCount))
    