#Функція приймає 2 параметра
# 1ший параметр- кількість разів
#2ий параметр-це текст, який ми виводимо
#Виводимо на екран в такому вигляді:
# 1-ТЕКСТ
# 2-ТЕКСТ
# n-ТЕКСТ
# Якщо перший параметр менший 0, то нічого не робимо
def myViewSalo(countTry,myText):
    #countTry=3 #Кількість спроб
    #myText="Сало"# це тект
    i=0 #лічильник циклу
    while i< countTry:
        print(f"{i+1} -{myText}")
        i+=1

count=input("Вкажіть кількість: ")
text=input("Вкажіть повідомлення: ")
myViewSalo(int(count),text)